Repository: asdo92/kernelinstall-lts
Catalog: po/*.po
Languages: it

source: Running
it: In esecuzione

source: Command failed: %s (exit %d)
it: Comando fallito: %s (uscita %d)

source: Progress:
it: Avanzamento:

source: whiptail not found. Installing...
it: whiptail non trovato. Installazione...

source: Cannot install whiptail on this distribution
it: Impossibile installare whiptail su questa distribuzione

source: Failed to install whiptail
it: Installazione di whiptail fallita

source: whiptail installed successfully. Restarting application...
it: whiptail installato con successo. Riavvio dell'applicazione...

source: Failed to restart
it: Riavvio fallito

source: Alexia Kernel Installer
it: Installatore Kernel Alexia

source: Alexia Kernel Installer Version
it: Versione dell'Installatore Kernel Alexia

source: This program will download, compile and install the latest stable kernel from kernel.org.
it: Questo programma scaricherà, compilerà e installerà l'ultimo kernel stabile da kernel.org.

source: The process may take up to three hours in some systems.
it: Il processo potrebbe richiedere fino a tre ore su alcuni sistemi.

source: Do you wish to continue
it: Desideri continuare?

source: Cleanup Build Files
it: Pulizia File di Compilazione

source: Do you want to clean up the build files
it: Vuoi pulire i file di compilazione?

source: Secure Boot enrollment skipped.
it: Registrazione Secure Boot saltata.

source: You can enroll the certificate later with: sudo mokutil --import /var/lib/shim-signed/mok/MOK_goldendoglinux.der
it: Puoi registrare il certificato in seguito con: sudo mokutil --import /var/lib/shim-signed/mok/MOK_goldendoglinux.der

source: Installation Complete
it: Installazione Completata

source: Reboot Now
it: Riavvia Ora

source: Reboot Later
it: Riavvia Più Tardi

source: has been successfully installed
it: è stato installato con successo

source: If you enrolled Secure Boot, complete the enrollment during reboot
it: Se hai registrato Secure Boot, completa la registrazione durante il riavvio

source: Rebooting system...
it: Riavvio del sistema...

source: Remember: If you enrolled Secure Boot, look for the blue MOK Manager screen!
it: Ricorda: se hai registrato Secure Boot, cerca la schermata blu del MOK Manager!

source: Remember to reboot the machine to boot with the latest kernel
it: Ricorda di riavviare la macchina per avviare con l'ultimo kernel

source: Thank you for using my software
it: Grazie per aver usato il mio software

source: Please keep it free for everyone
it: Per favore, mantienilo gratuito per tutti

source: Could not determine home directory
it: Impossibile determinare la directory home

source: Unsupported Linux distribution. Currently only Debian-based systems are supported.
it: Distribuzione Linux non supportata. Attualmente sono supportati solo i sistemi basati su Debian.

source: Detected distribution: %s
it: Distribuzione rilevata: %s

source: Whiptail installation failed. Continuing with text mode...
it: Installazione di Whiptail fallita. Continuo con la modalità testo...

source: Installation cancelled by user.
it: Installazione annullata dall'utente.

source: Creating build directory: %s
it: Creazione della directory di compilazione: %s

source: Path exists but is not a directory: %s
it: Il percorso esiste ma non è una directory: %s

source: Failed to create build directory
it: Creazione della directory di compilazione fallita

source: Installing required packages for %s...
it: Installazione dei pacchetti richiesti per %s...

source: Fetching latest kernel version from kernel.org...
it: Recupero dell'ultima versione del kernel da kernel.org...

source: Could not fetch latest kernel version.
it: Impossibile recuperare l'ultima versione del kernel.

source: Empty version string.
it: Stringa della versione vuota.

source: Latest stable kernel: %s
it: Ultimo kernel stabile: %s

source: Building and installing kernel for %s...
it: Compilazione e installazione del kernel per %s...

source: Updating bootloader for %s...
it: Aggiornamento del bootloader per %s...

source: Build files cleaned up.
it: File di compilazione ripuliti.

source: Generating GoldenDogLinux Secure Boot certificate...
it: Generazione del certificato Secure Boot GoldenDogLinux...

source: GoldenDogLinux certificate generated successfully.
it: Certificato GoldenDogLinux generato con successo.

source: Secure Boot Enrollment
it: Registrazione Secure Boot

source: Do you want to enroll the GoldenDogLinux certificate for Secure Boot?
it: Vuoi registrare il certificato GoldenDogLinux per Secure Boot?

source: This will allow your custom kernel to work with Secure Boot enabled.
it: Questo permetterà al tuo kernel personalizzato di funzionare con Secure Boot abilitato.

source: You will be asked to set a password and enroll the key during the next reboot.
it: Ti verrà chiesto di impostare una password e registrare la chiave durante il prossimoriavvio.

source: Continue with enrollment?
it: Continuare con la registrazione?

source: Enrolling GoldenDogLinux certificate for Secure Boot...
it: Registrazione del certificato GoldenDogLinux per Secure Boot...

source: === IMPORTANT SECURE BOOT INSTRUCTIONS ===
it: === ISTRUZIONI IMPORTANTI PER SECURE BOOT ===

source: 1. You will be asked to set a enrollment password now
it: 1. Ti verrà chiesto di impostare una password di registrazione ora

source: 2. During the next reboot, a blue screen (MOK Manager) will appear
it: 2. Durante il prossimo riavvio, apparirà una schermata blu (MOK Manager)

source: 3. Select 'Enroll MOK' > 'Continue' > 'Yes' > Enter the password
it: 3. Seleziona 'Enroll MOK' > 'Continue' > 'Yes' > Inserisci la password

source: 4. Select 'Reboot' to complete the enrollment
it: 4. Seleziona 'Reboot' per completare la registrazione

source: 5. After enrollment, your kernel will work with Secure Boot
it: 5. Dopo la registrazione, il tuo kernel funzionerà con Secure Boot

source: Configuring GoldendogLinux Signature...
it: Configurazione della firma GoldendogLinux...
